{
  "cs": {
    "home": "Domů",
    "about": "O mně",
    "skills": "Dovednosti",
    "portfolio": "Tvorba",
    "contact": "Kontakt",
    "greeting": "Zdravíčko, Jsem",
    "interest": "Se zájmem o ",
    "quote": "„Uprostřed problémů leží příležitost.“",
    "h2About": "O <span>Mně</span>",
    "h2Skills": "Moje <span>Dovednosti</span>",
    "h2Portfolio": "Poslední <span>Projekty</span>",
    "h2Contact": "Kontaktujte <span>Mě</span>",
    "aboutParagraph1":"Jsem nadšenec IT světa se zkušenostmi a hlubokým zájmem o moderní technologie. Již na základní škole, kdy jsem poprvé experimentoval s tvorbou webových stránek v HTML a CSS, jsem objevil fascinaci digitálním světem, která mě provází dodnes.",
    "aboutParagraph2":"Můj přístup je založen na neustálém sebevzdělávání a průzkumu nových technologií. Ve svém portfoliu najdete řadu projektů, které nejenže rozvíjejí mé technické dovednosti, ale zároveň řeší konkrétní reálné problémy. Kromě softwarového vývoje se věnuji také 3D modelování a tisku, kde vytvářím praktické předměty přesně podle aktuálních potřeb.",
    "aboutParagraph3":"Doma si provozuji vlastní homelab, kde experimentuji s virtuálními stroji a spravuji domácí server, smart home, NAS server i vlastní BTC node. Tento prostor mi umožňuje pracovat s Linux servery, Dockerem, SQL databázemi, Node-Red a dalšími moderními technologiemi.",
    "aboutParagraph4":"Nedávno jsem absolvoval kurz zaměřený na testování softwaru, během kterého jsem zdokonalil své schopnosti v těchto oblastech: <br>• Tvorba a exekuce testovacích scénářů<br>• Testování REST API a ověřování správnosti dat pomocí SQL<br>• Automatizace testů s využitím frameworku Playwright a Cypress<br>• Identifikace, reportování a sledování chyb",
    "aboutParagraph5":"Pokud máte zájem o spolupráci nebo máte nějaké dotazy, neváhejte mě <a href='#contact' aria-label='contact'>kontaktovat</a>. Těším se na příležitost spolupracovat!",
    "h3SkillsWeb":"Webový vývoj",
    "pSkillsWeb":"Tvorba webových aplikací za pomoci JavaScript, HTML a CSS",
    "h3SkillsManual":"Manualní testování",
    "pSkillsManual":"Tvorba a exekuce testovacích scénářů. Testování REST API a použití SQL pro ověřování správnosti dat.",
    "h3SkillsAuto":"Automatizované testování",
    "pSkillsAuto":"Automatizace testů pomocí frameworku Playwright nebo Cypress.",
    "h3SkillsOther":"Ostatní technologie",
    "pSkillsOther":"Proxmox, Linux server, Docker, Portainer, SQL DB, Node-Red, Home Assistant",
    "pProjectPhoto":"Python nástroj pro automatické rozřazení fotografií do složek, podle datumu pořízení fotografií.",
    "pProjectBtcTracker":"Tapeta do aplikace Wallpaper Engine, která sleduje aktuální cenu Bitcoinu.",
    "pProjectSwing":"Webová aplikace s časovačem navržená tak, aby vám pomohla sledovat váš pokrok.",
    "pProject2048":"Jednoduchá hra 2048 v JavaScriptu.",
    "pProjectTrezorStand":"Modelování a 3D Tisk stojánku na hardware peněženku Trezor Safe 3.",
    "pProjectEthTracker":"Tapeta do aplikace Wallpaper Engine, která zobrazuje aktuální cenu Etherea.",
    "pProjectCappuccino":"Modelování a 3D Tisk šablony na cappuccino ve tvaru Bitcoinu.",
    "pProjectBookmark":"Modelování a 3D Tisk záložky do knihy na téma Breaking Bad.",
    "pProjectWeb1":"Project z roku 2015, kdy jsem se snažil vytvořit web pro místní fitko.",
    "pProjectWeb2":"Project ve stejném stylu jako project pro fitko."
  },
  "en": {
    "home": "Home",
    "about": "About Me",
    "skills": "Skills",
    "portfolio": "Portfolio",
    "contact": "Contact",
    "greeting": "Hi, I'm",
    "interest": "Interested in ",
    "quote": "„In the middle of difficulty lies opportunity.“",
    "h2About": "About <span>Me</span>",
    "h2Skills": "My <span>Skills</span>",
    "h2Portfolio": "Latest <span>Projects</span>",
    "h2Contact": "Contact <span>Me</span>",
    "aboutParagraph1":"I am an IT enthusiast with extensive experience and a deep passion for modern technologies. I discovered my fascination with the digital world as early as elementary school when I first experimented with creating websites using HTML and CSS—a passion that continues to drive me today.",
    "aboutParagraph2":"My approach is rooted in continuous self-education and exploring new technologies. My portfolio features a range of projects that not only enhance my technical skills but also solve real-world problems. In addition to software development, I am involved in 3D modeling and printing, creating practical objects tailored to current needs.",
    "aboutParagraph3":"At home, I run my own homelab, where I experiment with virtual machines and manage a home server, smart home system, NAS server, and even my own BTC node. This setup enables me to work with Linux servers, Docker, SQL databases, Node-Red, and other modern technologies.",
    "aboutParagraph4":" recently completed a course focused on software testing, during which I honed my skills in the following areas: <br>•  Creating and executing test scenarios<br>•  Testing REST APIs and verifying data integrity using SQL<br>• Test automation with the Playwright and Cypress frameworks<br>• Identifying, reporting, and tracking bugs",
    "aboutParagraph5":"If you are interested in collaborating or have any questions, please do not hesitate to <a href='#contact' aria-label='contact'>contact me</a>. I look forward to the opportunity to work together!",
    "h3SkillsWeb":"Web development",
    "pSkillsWeb":"Creating web applications using JavaScript, HTML and CSS",
    "h3SkillsManual":"Manual testing",
    "pSkillsManual":"Creation and execution of test scenarios. Testing REST API and using SQL to verify data correctness.",
    "h3SkillsAuto":"Automated testing",
    "pSkillsAuto":"Test automation using the Playwright or Cypress framework.",
    "h3SkillsOther":"Other technologies",
    "pSkillsOther":"Proxmox, Linux server, Docker, Portainer, SQL DB, Node-Red, Home Assistant",
    "pProjectPhoto":"Python tool for automatically sorting photos into folders, based on the date the photos were taken.",
    "pProjectBtcTracker":"Wallpaper for the Wallpaper Engine application that tracks the current Bitcoin price.",
    "pProjectSwing":"A web application with a timer designed to help you track your progress in the kettlebell challenge.",
    "pProject2048":"A simple 2048 game in JavaScript.",
    "pProjectTrezorStand":"Modeling and 3D Printing of a stand for the Trezor Safe 3 hardware wallet.",
    "pProjectEthTracker":"Wallpaper Engine wallpaper showing the current price of Ethereum.",
    "pProjectCappuccino":"Modeling and 3D Printing a Bitcoin-shaped cappuccino template.",
    "pProjectBookmark":"Modeling and 3D Printing a bookmark for a book on the theme of Breaking Bad.",
    "pProjectWeb1":"Project from 2015, when I tried to create a website for a local gym.",
    "pProjectWeb2":"A project in the same style as the project for the gym."
  }
}
